/*==========================================================================================================================*/
/*=========================================================buzzer.h=========================================================*/
/*==========================================================================================================================*/
/*
/* 版权说明：杭州九阳欧南多小家电有限公司
/*
/* 文件名称：buzzer.h
/*          	 
/* 编制人员：西式电控/冯晓丽、郑明伟、毛树海
/*
/* 编制时间：2018年10月25日
/*			          	 
/* 软件版本： 1、V1.0/20181025（程序首次编制）
/*
/*			  2、修改后在此增加记录
/*
/* 硬件版本： 1、适用于2K/4K压电或电磁式蜂鸣器、单频
/*
/*			  2、修改后在此增加记录
/*
/* 文件描述：蜂鸣器程序配置头文件
/*   
/*           01、端口配置1   配置输出模式BUZ_IO_OUTPUT、配置上拉电阻BUZ_PULL_UP、配置I/O处于何端口BUZ_GPIO	     （据单片机进行端口配置）
/*
/*           02、省电模式    BUZ_POWER_SAVE	端口输出省电电平	 据不同单片机SFR/电路结构填写 关闭口
/*
/*			 03、调用频率    BuzzerCtrl蜂鸣器声音控制函数调用频率 BUZ_CALL_FRE	（可选择2ms 10ms 20ms）
/*
/*			 04、产品线配置	 产品线代码 BUZ_CURRENT （据产品线选择配置）
/*
/*			 05、变量定义	 声音类型变量 gU8_buzzerType（全局变量/unsigned char型） 
/*
/*			 06、变量定义	 声音生成驱动标志位 gb_buzzerDrive_flag	（全局变量/布尔值）
/*
/*			 07、变量定义	 蜂鸣次数变量 sU8_buzzerTimes	（静态局部变量/unsigned char型）
/*
/*			 08、变量定义	 蜂鸣计数变量 sU8_buzzerCount	（静态局部变量/unsigned char型）
/*
/*			 09、变量定义	 蜂鸣发声时间变量 sU8_buzzerOnTime（静态局部变量/unsigned char型）
/*
/*			 10、变量定义	 蜂鸣发声间隔时间变量 sU8_buzzerOffTime（静态局部变量/unsigned char型）
/*
/*			 11、函数声明    void BuzzerVariableInit(void)        //蜂鸣器变量初始化函数 
/*
/*			 12、函数声明    void BuzzerConfigureInit(void)	      //蜂鸣器端口配置初始化函数  在程序初始化函数中调用 
/*
/*			 13、函数声明    void BuzzerCtrl(void)	              //蜂鸣器处理函数 在程序主函数中调用（调用频率10ms或20ms）
/*			 
/* 注意事项：使用本文件时，请注意如下事宜
/*
/*			 01、不得任意改变标准模板文件，如有更改通知文件管理人员执行
/*
/*			 02、文件、函数、变量、宏定义等请符合九阳西式标准命名格式
/*
/*			 03、需要蜂鸣器发声请给gU8_buzzerType赋值所需的声音类型
/*
/*			 04、赋值完成后BuzzerCtrl函数将运算出声音生成驱动标志位 gb_buzzerDrive_flag，为真则开启PWM驱动或进行电平翻转	
/*
/* 			 05、蜂鸣器器不需要蜂鸣时，需要根据电路将端口电平置位在省电状态，否则电源功耗和板子温升将受影响
/*
/*==========================================================================================================================*/
/*==========================================================================================================================*/
/*==========================================================================================================================*/
/*
/*
/**/

#define Ture			1
#define False			0

/*----------------------------------------------------条件编译-------------------*/
#ifndef		_BUZZER_H_
#define		_BUZZER_H_ 													 //条件编译，如已有定义，无需定义
/*
/*
/*
/*----------------------------------------------------端口配置-------------------*/
#define		BUZZ_IO_OUTPUT    	P3CR  |=  BIT7			    			//端口输出模式配置	 据不同单片机SFR填写 设置为输出口
#define 	BUZ_PULL_UP   	 	P3PCR &= ~BIT7		    				//端口上拉电阻配置	 据不同单片机SFR填写 设置为关闭上拉
#define 	BUZ_GPIO	     	P3_7	    		    			    //端口指定初始化	 据不同单片机SFR填写  端口定义

#define     BUZ_POWER_SAVE      P3 &= ~BIT7						  	    //端口输出省电电平	 据不同单片机SFR/电路结构填写 
/*
/*
/*
/*----------------------------------------------------调用频率配置----------------*/
#define		BUZ_CALL_FRE        10										//BuzzerCtrl蜂鸣器声音控制函数调用频率 （可选择10ms 20ms 50ms）
/*
/*
/*
/*----------------------------------------------------各产品线产品线代码宏定义-----*/
#define 	BUZZER_JK		    1			    					    //煎烤产品线 （火锅、煎烤机）
#define 	BUZZER_HP		    2									    //烘焙产品线 （烤箱、空炸）
#define 	BUZZER_MT		    3										//面条产品线
#define 	BUZZER_PB		    4										//破壁产品线 （含料理）
#define 	BUZZER_ZZ		    5										//榨汁产品线

#define 	BUZ_CURRENT		    BUZZER_JK      							//产品线选择（不同产品线在此配置）
/*----------------------------------------------------各产品线声音类型定义--------*/
enum 		_Buzz_Type_{ 											   //枚举每种产品线声音

//            BUZ_MUTE			=   0,								   //静音功能		
/*---------------------煎烤产品线--*/ 
			
			BUZ_JK_NULL		    =   0,
    		BUZ_JK_POWER_ON		=  	1,          						//上电蜂鸣
   			BUZ_JK_KEY         	=   2,         							//按键有效蜂鸣
    		BUZ_JK_FINISH      	=   3,          						//功能完成蜂鸣
    		BUZ_JK_ALARM     	=   4,          						//报警蜂鸣
    		BUZ_JK_PREHEATING   =   5,          						//预热完成蜂鸣Preheating
			BUZ_JK_POINT     	=   6,          						//可恢复报警蜂鸣
			BUZ_JK_MUTE		    =   7,   								//静音功能
/*---------------------烘焙产品线--*/ 
    		BUZ_HP_NULL			=	0,         							//无蜂鸣
			BUZ_HP_POWER_ON		=  	1,          						//上电蜂鸣
   			BUZ_HP_KEY         	=   2,         							//按键有效蜂鸣
    		BUZ_HP_FINISH      	=   3,          						//功能完成蜂鸣
    		BUZ_HP_ALARM     	=   4,          						//报警蜂鸣  
    		BUZ_HP_PREHEATING   =   5,          						//预热完成蜂鸣
			BUZ_HP_MUTE		    =   6,   								//静音功能			      										
/*---------------------面条产品线--*/ 
    		BUZ_MT_NULL			=	0,         							//无蜂鸣
			BUZ_MT_POWER_ON		=  	1,          						//上电蜂鸣
   		    BUZ_MT_KEY         	=   2,         							//按键有效蜂鸣
			BUZ_MT_AUTORUN		=   3,									//自动启动
    		BUZ_MT_FINISH      	=   4,          						//结束蜂鸣
    		BUZ_MT_ALARM     	=   5,          						//异常报警蜂鸣  
    		BUZ_MT_COVER    	=   6,          						//合盖蜂鸣
    		BUZ_MT_CHECK        =   7,         							//检测报警（自检）
			BUZ_MT_WATER		=	8,									//缺水蜂鸣
			BUZ_MT_MUTE		    =   9,   								//静音功能

///*---------------------破壁产品线--*/ 
//          BUZ_PB_NULL			=	0,         							//无蜂鸣 
//    		BUZ_PB_POWER_ON		=  	1,          						//上电蜂鸣
//   		BUZ_PB_KEY         	=   2,         							//按键有效蜂鸣
//    		BUZ_PB_FINISH      	=   3,          						//功能完成蜂鸣
//    		BUZ_PB_ALARM     	=   4,          						//报警蜂鸣  
//    		BUZ_PB_FEEDNING    	=   5,          						//投料蜂鸣

/*---------------------榨汁产品线--*/
  			BUZ_ZZ_NULL			=	0,         							//无蜂鸣 
    		BUZ_ZZ_POWER_ON		=  	1,          						//上电蜂鸣
   	     	BUZ_ZZ_KEY         	=   2,         							//按键有效蜂鸣
    		BUZ_ZZ_FINISH      	=   3,          						//功能完成蜂鸣
    		BUZ_ZZ_ALARM     	=   4,          						//报警蜂鸣  
    		BUZ_ZZ_VACUUM    	=   5,          						//真空完成蜂鸣
			BUZ_ZZ_MUTE    	    =   6,          						//真空完成蜂鸣
};
/*----------------------------------------------------变量定义--------------------*/
typedef struct _BUZZER_DATA_{
	       unsigned char sU8_buzzerTimes;                                //蜂鸣次数变量	        （静态局部变量/unsigned char型）
	       unsigned char sU8_buzzerCount;                                //蜂鸣计数变量	        （静态局部变量/unsigned char型）
	       unsigned char sU8_buzzerOnTime;                               //蜂鸣发声时间变量	    （静态局部变量/unsigned char型）
	       unsigned char sU8_buzzerOffTime;                              //蜂鸣发声间隔时间变量 （静态局部变量/unsigned char型）
}BUZZER_DATA;


/*----------------------------------------------------函数声明-------------------*/
extern bit  gb_buzzerDrive_flag;                                          //声音生成驱动标志位
extern enum _Buzz_Type_  gU8_buzzerType;		                          // 声音类型变量
			
extern void BuzzerVariableInit(void);		                              //蜂鸣器变量初始化函数	  在程序初始化函数中调用
extern void BuzzerConfigureInit(void);		                              //蜂鸣器端口配置初始化函数  在程序初始化函数中调用
extern void BuzzerCtrl(void);			                                  //蜂鸣器处理函数 在程序主函数中调用（调用频率10ms或20ms）
extern void BuzzerDrive(void);
#endif







