/*-----------------------------------------------------------------------------
Description:		1ms延时函数
Input:				i（1ms的个数）
Return:				void
History:			无
-----------------------------------------------------------------------------*/
void Delay1ms(unsigned char i)
{
	unsigned int j;
	for(i;i>0;i--)
 		for(j=1600;j>0;j--);
}

/*-----------------------------------------------------------------------------
Description:		1us延时函数
Input:				i（1us的个数）
Return:				void
History:			无
-----------------------------------------------------------------------------*/
void Delay1us(unsigned char i)
{
	unsigned int j;
	for(i;i>0;i--)
 		for(j=20;j>0;j--);
}